Repository: kingrpaul/eo-glossary
Catalog: tm/the-dance-of-death-translation-level1.tmx
Source language: en_gb
Languages: eo

source: A flash of white light entered his heart and set him all on fire to know her.
eo: Ekbrilo de blanka lumo eniris lian koron kaj tute flamigis lin por koni ŝin.

source: A fresh stab of pain, worse than the first, gave him momentary pause.
eo: Freŝa piko de doloro, pli malbona ol la unua, donis al li momentan paŭzon.

source: A great pain ran swiftly through his heart as he looked.
eo: Granda doloro rapide trakuris lian koron dum li rigardis.

source: A note of darkness had crept in.
eo: Noto de mallumo estis enŝteliĝinta.

source: After that he gave it up finally.
eo: Post tio li rezignis ĝin finfine.

source: All day he was haunted and dismayed, and all day he heard the wind whispering among branches and the water lapping somewhere against sandy banks in the sun.
eo: La tutan tagon li estis hantita kaj konsternita, kaj la tutan tagon li aŭdis la venton flustranta inter branĉoj kaj la akvon plaŭdanta ie kontraŭ sablaj bordoj en la suno.

source: All else was mere shadow and fantasy.
eo: Ĉio alia estis nura ombro kaj fantazio.

source: All the time, however, there was an undercurrent of sadness and disappointment not to be denied.
eo: La tutan tempon, tamen, estis subfluo de malĝojo kaj seniluziiĝo, kiu ne povis esti neita.

source: And he knew then that his heart would never pain him again on earth, or cause him to fear for any of his beloved dreams.
eo: Kaj li sciis tiam, ke lia koro neniam plu doloros lin en la mondo, nek timigos lin pro iu ajn el liaj amataj revoj.

source: And now the knowledge that he had a weak heart came to spoil everything.
eo: Kaj nun la sciaĵo, ke li havas malfortan koron, venis por difekti ĉion.

source: And one day, when he should have saved enough, he looked forward vaguely to a life close to Nature, perhaps a shepherd on a hundred hills, a dweller in the woods, within sound of his beloved trees and waters, where the smell of the earth and camp fire would be ever in his nostrils, and the running stream always ready to bear his boat swiftly away into happiness.
eo: Kaj iun tagon, kiam li devus esti sufiĉe ŝparinta, li malklare antaŭĝojis pri vivo proksima al la Naturo, eble kiel paŝtisto sur cent montetoj, loĝanto en la arbaro, proksime al la sono de siaj amataj arboj kaj akvoj, kie la odoro de la tero kaj tendara fajro estus ĉiam en liaj naztruoj, kaj la fluanta rivereto ĉiam preta por rapide forporti lian boaton en feliĉon.

source: And the music was within them, rather than without; indeed they seemed to make their own music out of their swift whirling movements, for it never ceased and he never grew tired.
eo: Kaj la muziko estis ene de ili, kontraŭe al ekstere; ja ili ŝajnis krei sian propran muzikon el siaj rapidaj girantaj movoj, ĉar ĝi neniam ĉesis kaj li neniam laciĝis.

source: And, as the artificial light faded away, there came in its place a soft white light that filled the room with beauty and made all the faces look radiant.
eo: Kaj, dum la artefarita lumo fadis, venis en ĝia loko milda blanka lumo, kiu plenigis la ĉambron per beleco kaj faris ĉiujn vizaĝojn aspekti radiaj.

source: And, once, as they skimmed past a mirror, he saw that the girl beside him was not there⁠—that he seemed to be dancing alone, clasping no one; yet when he glanced down, there was her magical face at his shoulder and he felt her little form pressing up against him.
eo: Kaj, unufoje, dum ili glitis laŭ preter spegulo, li vidis, ke la fraŭlino apud li ne estis tie—ke li ŝajnis danci sole, kunpremante neniun; tamen, kiam li ĵete rigardis malsupren, tie estis ŝia magia vizaĝo ĉe lia ŝultro, kaj li sentis ŝian malgrandan formon premadi kontraŭ li.

source: Any moment the blow might fall.
eo: En iu ajn momento la bato eble falus.

source: At any other time Browne would probably have laughed, but the doctor’s serious manner put a touch of ice on the springs of laughter.
eo: En ajna alia tempo Braŭno verŝajne ridus, sed la serioza maniero de la kuracisto metis tuŝon da glacio sur la fontojn de rideco.

source: At first he danced cautiously, but by degrees the spirit of the time and place relieved his depression and helped him to forget.
eo: Komence li dancis singarde, sed grade la spirito de la tempo kaj de la loko mildigis lian deprimon kaj helpis lin forgesi.

source: At first he thought of sending an excuse.
eo: Komence li pensis sendi ekskuzon.

source: At the age of twenty-six one hardly realises death; life is still endless; and it is only old people who have “hearts” and suchlike afflictions.
eo: En la aĝo de dudek ses jaroj oni apenaŭ konscias morton; la vivo estas ankoraŭ senfina; kaj estas nur maljunuloj kiuj havas "korojn" kaj tiajn afliktojn.

source: Browne felt simply ecstatic; it was too wonderful to be true; it was impossible⁠—this meeting in London, at an ordinary dull dance, in the twentieth century.
eo: Braŭno sentis sin simple ekstaza; ĝi estis tro mirinda por esti vera; estis neeble⁠—ĉi tiu renkontiĝo en Londono, ĉe ordinara enuiga balo, en la dudeka jarcento.

source: Browne went to the dance feeling genuinely depressed, for the doctor had just warned him that his heart was weak and that he must be exceedingly careful in the matter of exertion.
eo: Braŭno iris al la balo sentante sin vere deprimita, ĉar la kuracisto ĵus avertis lin, ke lia koro estas malforta kaj ke li devas treege singardi pri la afero de streĉo.

source: But he could not wait forever, and it was already close upon two o’clock in the morning.
eo: Sed li ne povis atendi eterne, kaj jam estis preskaŭ la dua matene.

source: But he did not hesitate.
eo: Sed li ne hezitis.

source: But it seemed impossible to obtain an introduction from anyone.
eo: Sed ŝajnis neeble ricevi enkondukon de iu ajn.

source: But its benches afforded excellent sitting-out places, where strong light was not always an essential to happiness, and no one dreamed of finding fault.
eo: Sed ĝiaj benkoj disponigis bonegajn lokojn por sidi rande, kie forta lumo ne ĉiam estis esenco por feliĉo, kaj neniu konsideris kritiki.

source: But meanwhile he was dancing on wings, and the girl in green beside him seemed to fly too, and as he pressed her to his heart he found it impossible to think of anything else in the world but that⁠—that and his astounding happiness.
eo: Sed dume li dancis sur flugiloj, kaj la fraŭlino en verda apud li ŝajnis flugi ankaŭ, kaj dum li premis ŝin al sia koro, li trovis neeble pensi pri io alia en la mondo krom tio—tio kaj lia miriga feliĉo.

source: But the manager of the “hateful office” only knew two days later why Browne had not turned up to his desk, nor sent any word to explain his absence.
eo: Sed la administranto de la "malaminda oficejo" nure sciis du tagojn poste, kial Braŭno ne aperis ĉe sia skribtablo, nek sendis iun vorton por klarigi sian foreston.

source: But this sort of thing happened once or twice.
eo: Sed tia afero okazis unu-dufoje.

source: But, though he would gladly have availed himself of a sympathetic ear among the many there whom he knew intimately, he nevertheless exercised the restraint natural to his character, and avoided any reference to the matter that bulked so largely in his consciousness.
eo: Sed, kvankam li volonte utiligus simpatian orelon inter la multaj tie, kiujn li intime konis, li tamen ekzercis sin al sindeteno kiu estas natura en sia karaktero, kaj evitis ajnan aludon pri la afero, kiu faris sin tiel ampleksa en lia konscio.

source: By Jove, she was still there, a few feet in front of him, sitting with her arms upon the railing, peering down upon the dancers below.
eo: Per Jovo, ŝi ankoraŭ estis tie, kelkajn futojn antaŭ li, sidanta kun la brakoj sur la balustrado, rigardante malsupren al la dancantoj sube.

source: By the gods!
eo: Je la dioj!

source: Do you know who she is!” she asked foolishly.
eo: Ĉu vi scias, kiu ŝi estas!" ŝi demandis malsaĝe.

source: Especially he wondered who the man was she so favoured; he reminded him so oddly of himself.
eo: Precipe li scivolis, kiu estis la viro, kiun ŝi tiel favoris; li tiel strange rememorigis pri al si mem.

source: Even the doctor had smiled a little; and he now recalled more than one acquaintance who had the same trouble and made light of it.
eo: Eĉ la kuracisto ridetis iomete; kaj li nun rememoris pli ol unu konaton, kiuj havis la saman problemon kaj traktis ĝin malserioze.

source: Evidently la désirée was not a popular maiden.
eo: Evidente la dezirata ne estis populara fraŭlino.

source: Evidently no one knew this girl in green, or else he described her so inaccurately that the people he asked looked at someone else instead.
eo: Evidente neniu konis ĉi tiun fraŭlinon en verdo, aŭ alie li priskribis ŝin tiel malprecize, ke la homoj, kiujn li demandis, rigardis iun alian anstataŭe.

source: Foils and helmets hung round the walls, and high up under the brown rafters were ropes, rings, and trapezes coiled away out of reach, their unsightliness further concealed by an array of brightly coloured flags.
eo: Skermaj glavoj kaj skermaj kaskoj pendis ĉirkaŭe la muroj, kaj alte sub la brunaj tegmenta trabaro troviĝis ŝnuroj, ringoj kaj trapezoj volvitaj for ekster atingo, ilia malbeleco plu kaŝita de aro da hele koloraj flagoj.

source: For the first time in his existence he was alive, and knew that he was alive.
eo: Unuafoje en sia ekzistado li estis viva, kaj sciis, ke li estis viva.

source: Gradually the room emptied of its original comers, and others filled their places, silently, with airy graceful movements and happy faces, till the whole floor at length was covered with the soundless feet and whirling forms of those who had already left the world.
eo: Grade la ĉambro malpleniĝis de siaj originaj venintoj, kaj aliaj plenigis iliajn lokojn, silente, per aeraj graciaj movoj kaj feliĉaj vizaĝoj, ĝis la tuta planko finfine estis kovrita per la sensonaj piedoj kaj girantaj formoj de tiuj, kiuj jam forlasis la mondon.

source: Having no expectations, and absolutely no practical business ability, he was fortunate, however, in having a “place” at all, and the hard fact that promotion was unlikely made him all the more careful to keep his dreams in their place, to do his work as well as possible, and to save what little he could.
eo: Havante neniujn anticipojn, kaj tute neniun praktikan komercan kapablon, li estis fortuna, tamen, ĉar li havis "lokon" eĉ ĉi tiun, kaj la malmola fakto, ke promocio estis neverŝajna farigis lin des pli singarda por teni siajn revojn en ilia loko, fari sian laboron kiel eble plej bone, kaj por ŝpari la malmulton, kiom li povis.

source: He became transfigured with joy.
eo: Li transfiguriĝis pro ĝojo.

source: He did not like to insist.
eo: Li ne ŝatis insisti.

source: He felt the cool air of the open sky on his cheeks, and when he looked down, as they cleared the summit of the dark-lying hills, he saw that Issidy had melted away into himself and they had become one being.
eo: Li sentis la malvarmetan aeron de la malferma ĉielo sur siaj vangoj, kaj kiam li rigardis malsupren, dum ili superis la supron de la mallume kuŝantaj montetoj, li vidis, ke Izidio for'fandiĝis inter lin mem kaj ili fariĝis unu estaĵo.

source: He felt tired, awfully tired, more so than ever before at a dance.
eo: Li sentis sin laca, terure laca, pli ol iam antaŭe ĉe balo.

source: He found his partners dull, and they no doubt found him still duller.
eo: Li trovis siajn kun'danc'ant'inojn enuigaj, kaj ili sendube trovis lin eĉ pli enuiga.

source: He had never known any other girl than this one.
eo: Li neniam konis alian fraŭlinon ol ĉi tiun.

source: He had no introduction, but⁠—to the devil with the conventions.
eo: Li havis neniun enkondukon, sed⁠—al la diablo kun la konvencioj.

source: He had no real business instincts.
eo: Li havis neniajn realajn komercajn instinktojn.

source: He had no recollection of coming down the stairs.
eo: Li havis neniun memoron pri malsupreniro de la ŝtuparo.

source: He had probably exaggerated the importance of his malady.
eo: Li verŝajne troigis la gravecon de sia malsano. .

source: He knew, of course, there was nothing very sensational about being told that one’s heart was weak.
eo: Li sciis, kompreneble, ke nenio estas tre sensacia pri oni esti dirata, ke onies koro malfortas.

source: He leant against the wall for an instant just under the clock, where the hands pointed to two, waiting for the swooning blackness to go.
eo: Li apogis sin al la muro por momento tuj sub la horloĝo, kie la montriloj montris al du, atendante ĝis la svenigema nigreco forirus.

source: He lingered on much later than he intended in the hope of getting an introduction, but at last, when he had filled all his engagements, or nearly all, he made up his mind to slip out and go home.
eo: Li lantis multe pli malfrue ol li intencis esperante ricevi enkondukon, sed finfine, kiam li plenigis ĉiujn siajn rendevuojn, aŭ preskaŭ ĉiujn, li decidis elgliti kaj iri hejmen.

source: He made his way quickly up the wooden steps, light as air, trembling with anticipation.
eo: Li iris supren rapide laŭ la lignaj ŝtupoj, malpeze kiel aero, tremante per anticipo.

source: He might even be forced to spend his holiday, to say nothing of the dream of the far future, in some farmhouse “quietly,” instead of gloriously in the untrodden wilds.
eo: Li eĉ povus esti devigita pasigi sian ferion, sen paroli pri la revo de la malproksima estonteco, en iu kampara domo “kviete,” anstataŭ ol glore en la ne'sur'tret'itaj sovaĝejoj.

source: He must know her.
eo: Li devas koni ŝin.

source: He read it in the paper⁠—how he had dropped down dead at a dance, suddenly stricken by heart disease.
eo: Li legis ĝin en la gazeto—kiel li falis mortinta ĉe balo, subite trafita de kora malsano.

source: He sat down with a feeling that he had been flying in a free wind and was resting among the tops of trees.
eo: Li sidiĝis kun la sento, kvazaŭ li estis fluginta en libera vento kaj ripozas inter la suproj de arboj.

source: He slid down the side of the long room, dodging the dancers as best he could.
eo: Li glitis laŭ la flanko de la longa ĉambro, evitante la dancantojn kiel plej bone li povis.

source: He stared a moment, vaguely wondering, almost beside himself with delight.
eo: Li fikse rigardis dum momento, malklare scivolante, preskaŭ ekstaza pro ĝojo.

source: He still dawdled a little while, however, hoping for another glimpse of the sylph in green, hungering for a last look that he could carry home with him and perhaps mingle with his dreams.
eo: Li ankoraŭ lantis dum iom da tempo, tamen, esperante pri alia ekvido de la silfino en verda, malsatante je lasta rigardo, kiun li povus kunporti hejmen kaj eble intermiksigi kun siaj revoj.

source: He stopped short.
eo: Li haltis subite.

source: He topped the stairs and turned the corner.
eo: Li atingis la supron de la ŝtuparo kaj turniĝis ĉe la angulo.

source: He was an idealist at heart, hating the sordid routine of the life he led as a business underling.
eo: Li estis idealisto je koro, malamante la sordidan rutinon de la vivo kiun li vivis kiel komerca subulo.

source: He was in the act of turning his back on the whirl of dancing figures, when the flags at the far end of the room parted for an instant in the moving air, and his eye rested upon the gallery just visible among the shadows.
eo: Li estis en la ago de turni sian dorson al la girado de dancantaj figuroj, kiam la flagoj ĉe la malproksima fino de la ĉambro disiĝis dum momento en la moviĝanta aero, kaj lia rigardo ripozis sur la galerio apenaŭ videbla inter la ombroj.

source: He was just going to ask who the tall dark man was, when he saw that she was rising to her feet and that she wanted to dance.
eo: Li estis tuj demandonta, kiu estis la alta malhela viro, kiam li vidis, ke ŝi estis leviĝanta sur siajn piedojn kaj ke ŝi volis danci.

source: He went about carefully, making the ’buses stop dead before he got out, and going very slowly up steps.
eo: Li ĉirkaŭe iris singarde, postulante ke la ’busoj haltu kiel mortinte antaŭ ol li elirus, kaj suprenirante ĉiujn ŝtupojn tre malrapide.

source: He went up quite close past the empty seats, meaning to ask naturally and simply if he might beg for the pleasure of a dance.
eo: Li alproksimiĝis tre proksime preter la malplenaj seĝoj, intencante demandi nature kaj simple ĉu li povus petegi la plezuron de danco.

source: He would wake up presently from a dream of silver and gold.
eo: Li vekiĝus baldaŭ el sonĝo pri arĝento kaj oro.

source: Her dress, her hair, and a certain wondrous slim grace made him think of a young tree waving in the wind; of ivy leaves; of something that belonged to the life of the woods rather than to ordinary humanity.
eo: Ŝia robo, ŝia hararo, kaj certa mirinda svelta gracio pensigis lin pri juna arbo, svinganta en la vento; pri hederaj folioj; pri io, kio apartenis al la vivo de la arbaro anstataŭ ol al ordinara homaro.

source: Her idea, presumably, being to keep her victim going actively to the very end of the chapter, lest through indifference he should lose something of the lesson she wishes to teach.
eo: Ŝia ideo, supozeble, estas konservi sian viktimon aktive iranta ĝis la fina fino de la ĉapitro, por ke li ne perdus ion el la leciono, kiun ŝi deziras instrui, pro indiferenteco.

source: Her words amazed him.
eo: Ŝiaj vortoj mirigis lin.

source: Here was a girl he could speak with in the words of silence; she stretched every string in his soul and then played on them.
eo: Jen fraŭlino, kun kiu li povis paroli per la vortoj de silento; ŝi streĉis ĉiun ŝnureton en lia animo kaj poste ludis sur ili.

source: Here was his universe, framed in a green dress, with a voice of sea and wind, eyes like the sun, and movements of bending grasses.
eo: Jen lia universo, enkadrigita en verda robo, kun voĉo de maro kaj vento, okuloj kiel la suno, kaj movoj de kliniĝantaj herboj.

source: His dreams were of the open air, of mountains, forests, and great plains, of the sea, and of the lonely places of the world.
eo: Liaj revoj estis pri la malferma aero, pri montoj, arbaroj kaj grandaj ebenaĵoj, pri la maro kaj pri la solecaj lokoj de la mondo.

source: His eyes swam for a moment, and something clutched at the very roots of his being.
eo: Liaj okuloj naĝis dum momento, kaj io kaptis la radikojn mem de lia esteco.

source: His heart beat like a quick padded hammer, and the blood played a tambourine in his ears.
eo: Lia koro batis kiel rapida kusenetita martelo, kaj la sango ludis tamburinon en liaj oreloj.

source: His heart had ceased to pain him.
eo: Lia koro estis ĉesinta dolori sin.

source: His holidays were the only points of light in an otherwise dreary existence.
eo: Liaj ferioj estis la nuraj punktoj el lumo en alie malgaja ekzisto.

source: His partner required no steering.
eo: Lia kun'danc'ant'ino bezonis neniun gvidon.

source: His partners seemed to sniff a little when he asked.
eo: Liaj kun'danc'ant'inoj ŝajnis ekmovi la nazon iomete kiam li demandis.

source: His rooms were only a short distance down the street; he would light a cigarette and stroll home.
eo: Liaj ĉambroj estis nur mallongan distancon laŭ la strato; li ekbruligus cigaredon kaj promenus hejmen.

source: His spirit expanded with life and happiness.
eo: Lia spirito pligrandiĝis pro vivo kaj feliĉo.

source: His time might be short; he had known few enough of the good things of life; he would seize what he could.
eo: Lia tempo povus esti mallonga; li konis sufiĉe malmultajn el la bonaj aferoj de la vivo; li kaptus tion, kion li povus.

source: I know no one else here⁠—yet.”
eo: Mi konas neniun alian ĉi tie—ankoraŭ.”

source: I shall know how to take care of it.”
eo: Mi scipovos prizorgi ĝin.”

source: In that crowded ballroom they never once touched other people.
eo: En tiu homamasa bala salono ili neniam eĉ unufoje tuŝis aliajn homojn.

source: In vain he sought to compass an introduction to this girl.
eo: Vane li provis plani enkondukon al ĉi tiu fraŭlino.

source: Indeed, it was all he could do to prevent himself running forward at once with his arms outstretched to take her.
eo: Ja, estis ĉio, kion li povis fari por deteni sin de kurado antaŭen tuj kun la brakoj etenditaj por ĉirkaŭpreni ŝin.

source: It depressed him utterly.
eo: Ĝi tute deprimis lin.

source: It did not break on the consonants like most human speech.
eo: Ĝi ne rompiĝis je la konsonantoj kiel plej multaj homaj paroloj.

source: It flowed smoothly; it was the sound of wind among branches, of water running over pebbles.
eo: Ĝi fluis glate; estis la sono de vento inter branĉoj, de akvo fluanta super ŝtonetoj.

source: It happened just before two o’clock in the morning.
eo: Ĝi okazis ĵus antaŭ la dua horo matene.

source: It is a common trick of Nature⁠—and a profoundly significant one⁠—that, just when despair is deepest, she waves a wand before the weary eyes and does her best to waken an impossible hope.
eo: Estas ofta ruzo de la Naturo—kaj profunde signifa—ke, ĝuste kiam malespero estas plej profunda, ŝi svingas magian bastoneton antaŭ la lacaj okuloj kaj faras laŭeble por veki neeblan esperon.

source: It might catch him in the water, swimming, or halfway up the mountain, or midway in one of his lonely tramps, just when his enjoyment depended most upon his being reckless and forgetful of bodily limitations⁠—that freedom of the spirit in the wilderness he so loved.
eo: Ĝi eble kaptus lin en la akvo, naĝante, aŭ duonvoje supren sur la monto, aŭ meze de unu el liaj solecaj vagadoj, ĝuste kiam lia ĝuo plej dependis de lia malzorgemo kaj forgesemo pri korpaj limoj—tiu libereco de la spirito en la sovaĝejo, kiun li tiom amis.

source: It puzzled him for a moment how they reached the floor so quickly and found themselves among the whirling couples.
eo: Konfuzis lin dum momento, kiel ili atingis la plankon tiel rapide kaj trovis sin inter la girantaj paroj.

source: It seemed so rude to his partner.
eo: Ĝi ŝajnis tiel malĝentila al lia kun'danc'ant'ino.

source: It shook his dream to the very foundations.
eo: Ĝi skuis lian revon tute ĝis la fundamentoj.

source: It snatched beyond his reach at one fell swoop all that he most loved and enjoyed, destroying a thousand dreams, and painting the future a dull drab colour without hope.
eo: Ĝi forkaptis ekster lia atingo per unuopa svingo ĉion, kion li plej amis kaj ĝuis, detruante mil revojn, kaj pentrante la estontecon per malbrila koloro senespera.

source: It supplied him, in truth, with the extra little impetus he needed to set the will into vigorous action, for it reminded him forcibly of what might happen.
eo: Ĝi liveris al li, vere, la malgrandan kroman impeton, kiun li bezonis por meti la volon en viglan agon, ĉar ĝi devigante rememorigis lin pri tio, kio povus okazi.

source: It surely was the sound of wind in poplars.
eo: Ĝi certe estis la sono de vento en poploj.

source: It swept into him and caught him away, so that for a moment he saw his beloved woods and hills and seas.
eo: Ĝi balais en lin kaj forkaptis lin, tiel ke dum momento li vidis siajn amatajn arbarojn kaj montetojn kaj marojn.

source: It took place in a large hall that was used in the daytime as a gymnasium, but the floor was good and the music more than good.
eo: Ĝi okazis en granda halo, kiu estis uzata tage kiel gimnastikejo, sed la planko estis bona kaj la muziko ege bona.

source: It was already late, and he had to be in the office⁠—that hateful office⁠—punctually at nine o’clock.
eo: Jam estis malfrue, kaj li devis esti en la oficejo⁠—tiu malaminda oficejo⁠—akurate je la naŭa.

source: It was impossible to go home without speech, utterly impossible.
eo: Estis neeble iri hejmen sen parolo, tute neeble.
